app/controllers/passages_controller.rb

  def index
    @passages = Passage.all
---
SELECT "passages".* FROM "passages"

  def create
    @passage = Passage.new(passage_params)

    respond_to do |format|
      if @passage.save
---
INSERT INTO "passages" ("name", "passage", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mark 1:1"], ["passage", "The beginning of the Gospel of Jesus Christ, the Son of God"], ["created_at", "2016-09-14 00:46:59.593487"], ["updated_at", "2016-09-14 00:46:59.593487"]]

    def set_passage
      @passage = Passage.find(params[:id])
---
SELECT  "passages".* FROM "passages" WHERE "passages"."id" = ? LIMIT 1  [["id", 1]]