app/views/passages/show.html.erb

SELECT  "passages".* FROM "passages" WHERE "passages"."id" = ? LIMIT 1  [["id", 1]]
---
<script type="text/javascript">
  $( document ).ready(function() {
    $('#textarea').text("");
    var passage = "<%= @passage.passage %>";
    console.log(passage);
  $('#textarea').bind('input propertychange', function() {
      var text_input = $("#textarea").val();
      var text_input_length = text_input.length;
      if (text_input == passage.substring(0,text_input_length)){
        $("#passage").text(text_input);
        if (text_input.length == passage.length){
          setInterval(function(){passage_complete()},200);
        }
      }else {
        alert("You got something wrong");
      }
});
});